#!/usr/bin/python3
# -*- coding: utf-8 -*-

# @Time    : 2020/11/25 20:40
# @Author  : Yong
# @Email   : Yong_GJ@163.com
# @File    : task_9.4.6_importOtherModule.py
# @Software: PyCharm

# 在模块中导入另一个模块
# 有时候，需要将类分散到多个模块中，以免模块太大，或在同一个模块中存储不相关的类。
# 将类存储在多个模块中时，你可能会发现一个模块中的类依赖于另一个模块中的类。
# 在这种情况下，可在前一个模块中导入必要的类。

################################################################
################################################################
# electric_car.py
################################################################
'''
from car import Car


class Battery():
    --snip - -


class ElectricCar(Car):
    --snip - -
'''

################################################################
################################################################
# car.py
################################################################
"""一个可用于表示汽车的类"""
'''
class Car():
    --snip--
'''

################################################################
################################################################
# my_cars.py
################################################################
'''
from car import Car 
from electric_car import ElectricCar
my_beetle = Car('volkswagen', 'beetle', 2016) 
print(my_beetle.get_descriptive_name()) 
my_tesla = ElectricCar('tesla', 'roadster', 2016) 
print(my_tesla.get_descriptive_name())
'''
